/*
 Navicat Premium Data Transfer

 Source Server         : MyMac
 Source Server Type    : MySQL
 Source Server Version : 50542
 Source Host           : localhost
 Source Database       : moon-cake

 Target Server Type    : MySQL
 Target Server Version : 50542
 File Encoding         : utf-8

 Date: 09/24/2015 14:01:37 PM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `moonCake`
-- ----------------------------
DROP TABLE IF EXISTS `moonCake`;
CREATE TABLE `moonCake` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `image` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=28 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `moonCake`
-- ----------------------------
BEGIN;
INSERT INTO `moonCake` VALUES ('1', '广式月饼', '遍及全国、老少皆宜。皮薄、馅大，吃起来口感松软、细滑，表面光泽突出，实乃月饼中的大家。', 'img/1.jpg'), ('2', '京式月饼', '甜度和皮馅比例适中、口感松脆，宫廷风格、做工考究。精心挑选最好的食材，用心打造最具艺术的月饼。', 'img/2.jpg'), ('3', '滇式月饼', '火腿、蜂蜜、猪油、白糖，紫麦面粉为皮料烘烤而成。火腿香味扑鼻，蜜汁甜蜜诱人，尽情感受双重享受。', 'img/3.jpg'), ('4', '苏式月饼', '“酥”上加“酥”、饼馅紧致、一嗑即散。馅料有五仁、豆沙等，甜度高于其他月饼。小巧精致、爱不释手。', 'img/4.jpg'), ('5', '潮式月饼', '终年应市、中秋为佳。以猪油掺面粉作皮，包以甜馅烤培熟，饼身扁而洁白、入口香酥，亭亭玉立、雅致美观。', 'img/5.jpg'), ('6', '衢式月饼', '又称“衢州麻饼”，多为二寸见圆，特制的大麻饼可达二尺、重量二市斤以上，堪称月饼中的巨无霸。', 'img/6.jpg'), ('7', '冰皮月饼', '源自香港，冰皮使用糯米制成，外观白色、低温保存、味道甜美。高贵冷艳，一定是月饼中的白富美。', 'img/7.jpg'), ('8', '冰淇淋月饼', '馅料用冰淇淋做成的月饼！味道宜人、细腻滑润、凉甜可口、色泽多样，夏天根本停不下来好么！', 'img/8.jpg'), ('9', '水晶月饼', '梦幻似水晶、好像咬一口！皮料使用小麦淀粉制成，晶莹剔透。记得要趁热吃，不然冷了就咬不动咯～', 'img/9.jpg'), ('10', '元祖雪月饼', '元祖首创雪月饼系列，低脂低卡的水果优酪冰淇淋，包裹新鲜水果冰晶，加上Q滑的外皮～不说了，土豪快送我一个吧！', 'img/10.jpg'), ('11', '哈根达斯月饼', '中学为体、西学为用。奢华外观、极致口感，忍不住口水一直流。爱她，就带她吃，哈根达斯～月～饼～', 'img/11.jpg'), ('12', '星巴克月饼', '特制醇正星巴克哥伦比亚咖啡加入精选比利时榛子脆软馅，或者星巴克肯亚咖啡香浓芝士包裹蓝莓软馅，都是，完美～', 'img/12.jpg'), ('13', '五仁月饼', '配料考究、皮薄馅多、味美可口。花纹和字迹清晰、形状端正，不破皮、不露馅、分量足，可谓月饼中的业界良心，然并卵……', 'img/13.jpg'), ('14', '法式月饼', '中国传统节日精神内涵与法国糕点制作工艺的完美融合，经典雅致、高贵大方，光是看看肚子就饿了……', 'img/14.jpg'), ('15', '果蔬月饼', '馅心滑软、风味各异，馅料有哈密瓜、凤梨、荔枝、草莓、冬瓜、芋头、乌梅、橙等，配以果汁或果浆，爱美的你，应该拥有～', 'img/15.jpg'), ('16', '海味月饼', '顾名思义，馅料有鲍鱼、鱼翅、紫菜、鳐柱等，口味微带咸鲜，以甘香著称。爱吃海鲜的你不容错过～', 'img/16.jpg'), ('17', '纳凉月饼', '把百合、绿豆、茶水糅进月饼馅精制而成，清甜酥软、入口即化，有清润、美颜之功效。', 'img/17.jpg'), ('18', '十仁月饼', '该月饼个头巨大，是普通月饼的4到6倍。在传统五仁馅料的基础上，再增加五种其他馅料，取意为合家团圆十全十美。也被称为“买五仁送五仁”，那些叫嚷着“恨他就请他吃五仁月饼”的人们有了更好的选择。', 'img/18.jpg'), ('19', '巧克力香辣牛肉月饼', '外皮是巧克力，馅是麻辣牛肉，被指是外焦里嫩的逆转版。据称，十年前，一位女生在机场对男友说：我和你是不可能的，就像巧克力和牛肉不可能在一起一样。十年后，一位点心师面对着巧克力香辣牛肉月饼的生产线，泪流满面。', 'img/19.jpg'), ('20', '酸辣月饼', '馅的酸来自老坛酸菜和山楂，辣则来自类似于老干妈辣酱的原料。刚一上市，就被视为“黑暗料理新秀”。少年，来一口？', 'img/20.jpg'), ('21', '奶酥松露鹅肝月饼', '据称这是最新的土豪识别器，月饼中的LV。但在全国厉行节俭的风气下，建议谨慎食用。', 'img/21.jpg'), ('22', '韭菜月饼', '当这款月饼问世时，最高兴的是五仁月饼的拥趸，他们哭着说，谁敢再说五仁是最难吃的月饼？', 'img/22.jpg'), ('23', '腐乳月饼', '据称是潮汕一带著名的饼食腐乳饼的变种，后者是当地人每逢初一十五摆神台时常用的祭品，稍加改装就成了月饼。', 'img/23.jpg'), ('24', '菊花普洱月饼', '菊花……普洱……光听……名字……就……醉……了……', 'img/24.jpg'), ('25', '梅菜扣肉月饼', '老板，我就问你一件事情，你怎么做到把菜塞到月饼里的？', 'img/25.jpg'), ('26', '方便面月饼', '由被称为“手工帝”的魏泽楷独家制作，上好的面皮夹着香气扑鼻的红烧牛肉方便面，这画面太美我不敢看。', 'img/26.jpg'), ('27', '竹炭月饼', '竹炭月饼据是将食用竹炭粉加入月饼烤制而成，噱头是说具有吸收体内毒素的功能。至于你吃不吃，反正我是不会吃的。', 'img/27.jpg');
COMMIT;

-- ----------------------------
--  Table structure for `user`
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `moonCakeId` int(11) NOT NULL,
  `timestamp` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `user`
-- ----------------------------
BEGIN;
INSERT INTO `user` VALUES ('3', '张宏伦', '10', '1443065765'), ('4', '乖比比', '7', '1443074404');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
